#+TITLE: Notes

#+begin_src elisp :noweb true :results none
        (org-babel-lob-ingest "/home/jed/.doom.d/babel/notes.org")
#+end_src


*** Print as an org-table
Given a course name, print the next x assignments in an org-table

#+name: upcomming_assignments
#+begin_src python :tangle course_calendar :noweb yes :results output table drawer replace :var x=10 :var name="comm2367"
<<python_rest_imports>>
<<fetch_course_calendar>>
<<get_course_info>>
<<get_next_assignments>>
<<orgify_description>>
<<orgify_timestamp>>
<<orgify_status>>
<<orgify_title>>
def generate_upcomming_assignments_table(course_name, num):
    assignment_list = get_next_assignments(course_name, num)
    print("| Assignment Name | Status | Due Date |")
    print("|-----------------+--------+----------|")
    #print(assignment_list)

    #if (len(assignment_list) < 1):
    #    print("| %s | | | |" % "All done! Congrats!!!")
    #    return

    for i, j in enumerate(assignment_list):
        assignment = assignment_list[i]
        print("| %s |"  % orgify_title(assignment),end="")
        print(" %s |"   % orgify_status(assignment["assignment"]["user_submitted"]),end="")
        print(" %s |"   % orgify_timestamp(assignment["start_at"]),end="\n")
        #print(" %s |"   % orgify_description(assignment["description"]),end="\n")

if __name__ == "__main__":
    generate_upcomming_assignments_table(name, x)

#+end_src

#+RESULTS: upcomming_assignments
:results:
2023-01-08 20:56:51.154298
| Assignment Name                                         | Status | Due Date               | Description                                        |
|---------------------------------------------------------+--------+------------------------+----------------------------------------------------|
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216171][Quiz #1: Covers the Syllabus]]                            | ❌     | <2023-01-17 Tue 23:59> | For each of the following, please choose the best  |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216168][Quiz #2: Covers Chapters 1, 10, 11, and 12]]              | ❌     | <2023-01-20 Fri 23:59> | For each of the following, please choose the best  |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216163][Quiz #3: Covers Chapters 2A and 3]]                       | ❌     | <2023-01-27 Fri 23:59> | For each of the following, please choose the best  |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216202][Topic Ideas]]                                             | ❌     | <2023-01-27 Fri 23:59> | Please submit your tentative topic idea by Friday, |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216170][Quiz #4: Covers Chapters 4 and 5]]                        | ❌     | <2023-02-03 Fri 23:59> | For each of the following, please choose the best  |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216177][Annotated Bibliography Paper]]                            | ❌     | <2023-02-03 Fri 23:59> | <a class="instructure_file_link instructure_scribd |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216175][Media and Persuasion Speech #1]]                          | ❌     | <2023-02-07 Tue 23:59> | We will be sharing real-world examples of the diff |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216162][Quiz #5 (Covers Chapter 6) ]]                             | ❌     | <2023-02-17 Fri 23:59> | For each of the following, please choose the best  |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216196][Problem Analysis Paper DRAFT for Peer Review Assignment]] | ❌     | <2023-02-17 Fri 23:59> | Please submit a DRAFT of your Problem Analysis Pap |
| [[https://canvas.instructure.com/courses/85970000000133176/assignments/8597~3216161][Quiz #6: Covers Chapters 2B and 7]]                       | ❌     | <2023-02-24 Fri 23:59> | For each of the following, please choose the best  |
:end:

